{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "dbf887db",
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "import requests\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import csv\n",
    "import random\n",
    "\n",
    "# DBpedia endpoint URL\n",
    "endpoint = \"https://dbpedia.org/sparql\"\n",
    "\n",
    "# SPARQL query to retrieve data for countries with population greater than 30,000,000\n",
    "query = \"\"\"\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbp: <http://dbpedia.org/property/>\n",
    "\n",
    "SELECT DISTINCT ?country ?capital ?city1 ?city2 ?city3\n",
    "WHERE {\n",
    "  ?country a dbo:Country ;\n",
    "           dbp:populationTotal ?pop ;\n",
    "           dbo:capital ?capital ;\n",
    "           dbo:largestCity ?city1 ;\n",
    "           dbo:largestCity ?city2 ;\n",
    "           dbo:largestCity ?city3 .\n",
    "  FILTER (?pop > 30000000 && ?city1 != ?capital && ?city2 != ?capital && ?city3 != ?capital)\n",
    "}\n",
    "ORDER BY RAND()\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "# Set up the SPARQL connection\n",
    "sparql = SPARQLWrapper(endpoint)\n",
    "sparql.setQuery(query)\n",
    "sparql.setReturnFormat(JSON)\n",
    "\n",
    "# Send the SPARQL query and handle the response\n",
    "results = sparql.query().convert()\n",
    "\n",
    "# Randomize the order of the results\n",
    "random.shuffle(results[\"results\"][\"bindings\"])\n",
    "\n",
    "# Write the result data to a CSV file\n",
    "with open(\"country_data.csv\", \"w\", newline=\"\") as f:\n",
    "    writer = csv.writer(f)\n",
    "    \n",
    "    # Write the header row\n",
    "    writer.writerow([\"Country\", \"Capital\", \"Largest City 1\", \"Largest City 2\", \"Largest City 3\"])\n",
    "    \n",
    "    # Write data for each country\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        country = result[\"country\"][\"value\"].split(\"/\")[-1]\n",
    "        capital = result[\"capital\"][\"value\"].split(\"/\")[-1]\n",
    "        city1 = result[\"city1\"][\"value\"].split(\"/\")[-1]\n",
    "        city2 = result[\"city2\"][\"value\"].split(\"/\")[-1]\n",
    "        city3 = result[\"city3\"][\"value\"].split(\"/\")[-1]\n",
    "        writer.writerow([country, capital, city1, city2, city3])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "424c3607",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "随机5个人口大于30000000的国家名字：\n",
      "South India\n",
      "Southeastern United States\n",
      "Appalachia\n",
      "Northeast India\n",
      "Southern United States\n"
     ]
    }
   ],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import random\n",
    "\n",
    "# 设置SPARQL endpoint\n",
    "sparql = SPARQLWrapper(\"https://dbpedia.org/sparql\")\n",
    "\n",
    "# 编写SPARQL查询语句\n",
    "query = \"\"\"\n",
    "SELECT ?countryName\n",
    "WHERE {\n",
    "  ?country a dbo:Country ;\n",
    "           rdfs:label ?countryName ;\n",
    "           dbp:populationTotal ?population .\n",
    "  FILTER (langMatches(lang(?countryName), \"en\") && ?population > 30000000)\n",
    "}\n",
    "ORDER BY RAND()\n",
    "LIMIT 5\n",
    "\"\"\"\n",
    "\n",
    "# 执行SPARQL查询\n",
    "sparql.setQuery(query)\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "\n",
    "# 输出结果\n",
    "print(\"随机5个人口大于30000000的国家名字：\")\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    print(result[\"countryName\"][\"value\"])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "17d32ed8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "随机选择的10个国家：\n",
      "1. Appalachia\n",
      "2. Southern_United_States\n",
      "3. Silesia\n",
      "4. Southeastern_United_States\n",
      "5. Western_United_States\n"
     ]
    }
   ],
   "source": [
    "import requests\n",
    "import random\n",
    "\n",
    "# 从DBpedia SPARQL端点获取人口大于30000000的国家名字\n",
    "query = '''\n",
    "PREFIX dbo: <http://dbpedia.org/ontology/>\n",
    "PREFIX dbp: <http://dbpedia.org/property/>\n",
    "\n",
    "SELECT ?country\n",
    "WHERE {\n",
    "  ?country a dbo:Country ;\n",
    "           dbp:populationTotal ?pop .\n",
    "  FILTER(?pop > 70000000) .\n",
    "}\n",
    "'''\n",
    "\n",
    "endpoint = 'https://dbpedia.org/sparql'\n",
    "params = {'query': query, 'format': 'json'}\n",
    "response = requests.get(endpoint, params=params)\n",
    "results = response.json()['results']['bindings']\n",
    "\n",
    "# 随机选择10个结果并提取国家名字\n",
    "countries = [result['country']['value'].split('/')[-1] for result in random.sample(results, 5)]\n",
    "\n",
    "# 输出结果\n",
    "print('随机选择的10个国家：')\n",
    "for i, country in enumerate(countries):\n",
    "    print(f'{i+1}. {country}')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "id": "bec7a2f8",
   "metadata": {},
   "outputs": [
    {
     "ename": "KeyError",
     "evalue": "'country'",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mKeyError\u001b[0m                                  Traceback (most recent call last)",
      "\u001b[1;32m~\\AppData\\Local\\Temp\\ipykernel_9812\\2175271151.py\u001b[0m in \u001b[0;36m<module>\u001b[1;34m\u001b[0m\n\u001b[0;32m     97\u001b[0m \u001b[0mcountry_name\u001b[0m \u001b[1;33m=\u001b[0m \u001b[1;34m\"China\"\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     98\u001b[0m \u001b[1;32mfor\u001b[0m \u001b[0mi\u001b[0m \u001b[1;32min\u001b[0m \u001b[0mrange\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;36m3\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m---> 99\u001b[1;33m     \u001b[0mquestion\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mqg\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mnew_question\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mcountry_name\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    100\u001b[0m     \u001b[0mprint\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mquestion\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;34m\"description\"\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    101\u001b[0m     \u001b[0mprint\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mquestion\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;34m\"options\"\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m~\\AppData\\Local\\Temp\\ipykernel_9812\\2175271151.py\u001b[0m in \u001b[0;36mnew_question\u001b[1;34m(self, country_name)\u001b[0m\n\u001b[0;32m     28\u001b[0m         \u001b[1;31m# 随机选择一个国家实体并获取其首都和其他城市\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     29\u001b[0m         \u001b[0mselected_country\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mrandom\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mchoice\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mresults\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;34m\"results\"\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;34m\"bindings\"\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m---> 30\u001b[1;33m         \u001b[0mcountry_id\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mselected_country\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;34m\"country\"\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;34m\"value\"\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0msplit\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\"/\"\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;33m-\u001b[0m\u001b[1;36m1\u001b[0m\u001b[1;33m]\u001b[0m  \u001b[1;31m# 获取实体 ID\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m     31\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     32\u001b[0m         \u001b[1;31m# 检查字典中是否包含所需的键\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;31mKeyError\u001b[0m: 'country'"
     ]
    }
   ],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import random\n",
    "\n",
    "\n",
    "class QuestionGenerator:\n",
    "    def __init__(self):\n",
    "        self.sparql = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "        self.sparql.setReturnFormat(JSON)\n",
    "\n",
    "    def new_question(self, country_name):\n",
    "        # 获取人口大于 30000000 的国家实体及其人口信息\n",
    "        # 构建查询，使用变量传递实体名称\n",
    "        query = f\"\"\"\n",
    "            SELECT DISTINCT ?capital ?capitalLabel WHERE {{\n",
    "              ?country rdfs:label \"{country_name}\"@en ;\n",
    "                       wdt:P36 ?capital .\n",
    "              SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"en\". }}\n",
    "            }}\n",
    "            \"\"\"\n",
    "        self.sparql.setQuery(query)\n",
    "        results = self.sparql.query().convert()\n",
    "\n",
    "        # 检查结果是否为空\n",
    "        if len(results[\"results\"][\"bindings\"]) == 0:\n",
    "            error_message = f\"Sorry, we could not find enough information about {country_name}. Please try another question.\"\n",
    "            return {\"description\": error_message, \"options\": \"\", \"correct_answer\": None}\n",
    "\n",
    "        # 随机选择一个国家实体并获取其首都和其他城市\n",
    "        selected_country = random.choice(results[\"results\"][\"bindings\"])\n",
    "        country_id = selected_country[\"country\"][\"value\"].split(\"/\")[-1]  # 获取实体 ID\n",
    "\n",
    "        # 检查字典中是否包含所需的键\n",
    "        if \"capitalLabel\" not in selected_country or \"countryLabel\" not in selected_country:\n",
    "            error_message = f\"Sorry, we could not find enough information about {country_name}. Please try another question.\"\n",
    "            return {\"description\": error_message, \"options\": \"\", \"correct_answer\": None}\n",
    "\n",
    "        # 从选定的国家实体中提取首都名称和其他城市列表\n",
    "        country_name = selected_country[\"countryLabel\"][\"value\"]\n",
    "        query = \"\"\"\n",
    "            SELECT DISTINCT ?capital ?capitalLabel ?city ?cityLabel WHERE {\n",
    "              VALUES ?country { wd:%s }\n",
    "              ?country wdt:P36 ?capital ;\n",
    "                       wdt:P17 ?place .\n",
    "              ?city wdt:P131+ ?place ;\n",
    "                    wdt:P31/wdt:P279* wd:Q515 .\n",
    "              FILTER (?capital != ?city)\n",
    "              SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". }\n",
    "            }\n",
    "            \"\"\" % (country_id)  # 在查询中使用正确的实体 ID\n",
    "        self.sparql.setQuery(query)\n",
    "        results = self.sparql.query().convert()\n",
    "\n",
    "        # 处理结果为空的情况\n",
    "        if len(results[\"results\"][\"bindings\"]) == 0:\n",
    "            error_message = f\"Sorry, we could not find enough information about {country_name}. Please try another question.\"\n",
    "            return {\"description\": error_message, \"options\": \"\", \"correct_answer\": None}\n",
    "\n",
    "        # 如果实体数量不足 3 个，则返回全部实体；否则随机排序首都和其他城市，并记录正确选项的位置\n",
    "        # 如果实体数量不足 3 个，则返回全部实体\n",
    "        options = []\n",
    "        correct_answer = None\n",
    "        if len(results[\"results\"][\"bindings\"]) < 3:      \n",
    "            options_set = set()\n",
    "            for option in results[\"results\"][\"bindings\"]:\n",
    "                option_name = option[\"capitalLabel\"][\"value\"]\n",
    "                if option_name not in options_set:\n",
    "                    options_set.add(option_name)\n",
    "                    options.append(f\"{len(options) + 1}. {option_name}\")\n",
    "                    if option == selected_country:\n",
    "                        correct_answer = len(options) - 1\n",
    "            while len(options) < 3:\n",
    "                random_option = random.choice(results[\"results\"][\"bindings\"])[\"capitalLabel\"][\"value\"]\n",
    "                if random_option not in options_set:\n",
    "                    options_set.add(random_option)\n",
    "                    options.append(f\"{len(options) + 1}. {random_option}\")\n",
    "        else:   # 实体数量足够 3 个\n",
    "            options_list = random.sample(results[\"results\"][\"bindings\"], 3)\n",
    "            for index, option in enumerate(options_list):\n",
    "                option_name = option[\"capitalLabel\"][\"value\"]\n",
    "                options.append(f\"{index + 1}. {option_name}\")\n",
    "                if option == selected_country:\n",
    "                    correct_answer = index\n",
    "            if correct_answer is None:\n",
    "                correct_answer = random.randint(0, 2)\n",
    "\n",
    "        # 生成题目及选项并返回\n",
    "        options_text = \"\\n\".join(options)\n",
    "        question = {\n",
    "            \"description\": f\"What is the capital city of {country_name}?\",\n",
    "            \"options\": options_text,\n",
    "            \"correct_answer\": correct_answer\n",
    "        }\n",
    "        return question\n",
    "\n",
    "\n",
    "qg = QuestionGenerator()\n",
    "country_name = \"China\"\n",
    "for i in range(3):\n",
    "    question = qg.new_question(country_name)\n",
    "    print(question[\"description\"])\n",
    "    print(question[\"options\"])\n",
    "    print(\"-\" * 10)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "84e45bf1",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "6d8f017b",
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "def _query(q):\n",
    "    \"\"\"\n",
    "    Queriaes the dbpedia sparql endpoint.\n",
    "    :param q: Query string.\n",
    "    :type q: str\n",
    "    :return: Query answer.\n",
    "    :rtype: dict\n",
    "    \"\"\"\n",
    "    try:\n",
    "        params = {'query': q}\n",
    "        resp = requests.get(db_url, params=params, headers={'Accept': 'application/json'})\n",
    "        return resp.text\n",
    "    except Exception as e:\n",
    "        print(e)\n",
    "        raise\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "f5f5917b",
   "metadata": {},
   "outputs": [],
   "source": [
    "db_url = \"http://dbpedia.org/sparql\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "753d0941",
   "metadata": {},
   "outputs": [],
   "source": [
    "query_string = f\"\"\"PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    SELECT ?label_subject ?object ?label_object ?label_predicate ?range\n",
    "    WHERE {{\n",
    "        ?subject dbo:wikiPageLength ?wikipagelength.\n",
    "        ?subject rdfs:label ?label_subject.\n",
    "        OPTIONAL {{?object rdfs:label ?label_object.}}\n",
    "\n",
    "    }}\n",
    "    ORDER BY ?wikipagelength\n",
    "    LIMIT 200\n",
    "    \"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "a82cd53f",
   "metadata": {},
   "outputs": [],
   "source": [
    "rdfs  = _query(query_string)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "7c0e461b",
   "metadata": {},
   "outputs": [],
   "source": [
    "with open('output.txt', 'w') as f:\n",
    "    f.write(rdfs)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f93550d5",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
